import './Blog.css'

const Blogs = () => {
  return (
  <div className='Blog'>
    <h2>Random Thoughts</h2>  
    <div className="Blog-div">
    <div> 对生活的无力一般会来自哪里呢？最近很大的一个感受是fomo，可能这是我对生活的无力感吧。</div>
    <div> 很多时候会觉得很多文字没有意义，但同时内心里又在为那些“无意义”寻找和宣扬意义。</div>
    <div> 本是自由的精神被困在物理的身体里，但是社会性压迫过来限制精神。仔细思考，我的精神也在被我的行为所限制，被我无法抗拒的fomo所限制，有时候我无法抗拒周围环境给我带来的影响，在不知不觉中。
    有时候令我很难过的是，意识到我所体验到的自由建立在我的不自由之上。建立在我不自由的精神背景上，建立在打破不自由的经济环境上。而这些相对立的矛盾并不能使我成为一个真正自由的人。而怎么样才能寻找到真正的自由呢？
    我见到了很多矛盾。</div>
    <div>生活和生存很多时候不能分离。我们都在学着如何去更好的生活。感觉生活是个拉锯战，在各种情况之间拉锯。而我被限制在拉锯之中，无法摆脱。</div>
    <div>纽约的生存和生活重合度很高，很多人的生活是生存，真是一个奇怪的地方！我也经常想逃离，但是我的身体上绑了各种不同的线，在世界不同的端点拉扯。我的力量还没有强到能够拉扯他们。也许这就是找寻的控制感。</div>
    </div>
  </div>
  )
};

export default Blogs;
